rottenpotatoes/app/controllers/movies_controller.rb

  def show
    @id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(@id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "release_date" = '2011-08-11 00:00:00.000000', "updated_at" = '2015-10-07 17:08:19.019089' WHERE "movies"."id" = 4